artillery/api-load.yml
config:
  target: "http://localhost:4000"
  http:
    # Responses have to be sent within 60 seconds, or an `ETIMEDOUT` error gets raised.
    timeout: 60
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load

scenarios:
  - name: "Getting data"
    flow:
      - get:
          url: "/"